micropython/micropython/ports/esp32/machine_encoder.c
/*
 * This file is part of the Micro Python project, http://micropython.org/
 * This file was generated by micropython-extmod-generator https://github.com/prusnak/micropython-extmod-generator
 * from Python stab file pcnt.py
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2020-2021 Ihor Nehrutsa
 * Copyright (c) 2021 Jonathan Hogg
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/*
ESP32 Pulse Counter
https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/peripherals/pcnt.html
Wrapped around
https://github.com/espressif/esp-idf/blob/master/components/driver/include/driver/pcnt.h
https://github.com/espressif/esp-idf/blob/master/components/hal/include/hal/pcnt_types.h
https://github.com/espressif/esp-idf/blob/master/components/driver/pcnt.c
See also
https://github.com/espressif/esp-idf/tree/master/examples/peripherals/pcnt/pulse_count_event
*/

/*
ESP32 Quadrature Counter based on Pulse Counter(PCNT)
Based on
https://github.com/madhephaestus/ESP32Encoder
https://github.com/bboser/MicroPython_ESP32_psRAM_LoBo/blob/quad_decoder/MicroPython_BUILD/components/micropython/esp32/machine_dec.c
See also
https://github.com/espressif/esp-idf/tree/master/examples/peripherals/pcnt/rotary_encoder
*/

#include "py/runtime.h"
#include "mphalport.h"
#include "modmachine.h"

#if MICROPY_PY_MACHINE_PCNT

#include "driver/pcnt.h"
#include "soc/pcnt_struct.h"
#include "esp_err.h"

#include "machine_encoder.h"

#define GET_INT mp_obj_get_int_truncated
// #define GET_INT mp_obj_get_ll_int // need PR: py\obj.c: Get 64-bit integer arg. #80896

static pcnt_isr_handle_t pcnt_isr_handle = NULL;
static mp_pcnt_obj_t *pcnts[PCNT_UNIT_MAX] = {};

/* Decode what PCNT's unit originated an interrupt
 * and pass this information together with the event type
 * the main program using a queue.
 */
#if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
#define H_LIM_LAT cnt_thr_h_lim_lat_un
#define L_LIM_LAT cnt_thr_l_lim_lat_un
#define THRES0_LAT cnt_thr_thres0_lat_un
#define THRES1_LAT cnt_thr_thres0_lat_un
#define ZERO_LAT cnt_thr_zero_lat_un
#else
#define H_LIM_LAT h_lim_lat
#define L_LIM_LAT l_lim_lat
#define THRES0_LAT thres0_lat
#define THRES1_LAT thres1_lat
#define ZERO_LAT zero_lat
#endif
STATIC void IRAM_ATTR pcnt_intr_handler(void *arg) {
    for (int id = 0; id < PCNT_UNIT_MAX; ++id) {
        if (PCNT.int_st.val & (1 << id)) {
            mp_pcnt_obj_t *self = pcnts[id];

            if (PCNT.status_unit[id].H_LIM_LAT) {
                self->counter += INT16_ROLL;
            } else if (PCNT.status_unit[id].L_LIM_LAT) {
                self->counter -= INT16_ROLL;
            }

            if (PCNT.status_unit[id].THRES1_LAT) {
                if (self->counter == self->counter_match1) {
                    mp_sched_schedule(self->handler_match1, MP_OBJ_FROM_PTR(self));
                }
            }
            if (PCNT.status_unit[id].THRES0_LAT) {
                if (self->counter == self->counter_match2) {
                    mp_sched_schedule(self->handler_match2, MP_OBJ_FROM_PTR(self));
                }
            }
            if (PCNT.status_unit[id].ZERO_LAT) {
                if (self->counter == 0) {
                    mp_sched_schedule(self->handler_zero, MP_OBJ_FROM_PTR(self));
                }
            }

            PCNT.int_clr.val |= 1 << id; // clear the interrupt
        }
    }
}

STATIC void register_isr_handler(void) {
    if (pcnt_isr_handle == NULL) {
        check_esp_err(pcnt_isr_register(pcnt_intr_handler, (void *)0, (int)0, (pcnt_isr_handle_t *)&pcnt_isr_handle));
        if (pcnt_isr_handle == NULL) {
            mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("wrap interrupt failed"));
        }
    }
}

/* Calculate the filter parameters based on an ns value
   1 / 80MHz = 12.5ns - min filter period
   12.5ns * FILTER_MAX = 12.5ns * 1023 = 12787.5ns - max filter period */
#define ns_to_filter(ns) ((ns * (APB_CLK_FREQ / 1000000) + 500) / 1000)
#define filter_to_ns(filter) (filter * 1000 / (APB_CLK_FREQ / 1000000))

STATIC uint16_t get_filter_value_ns(pcnt_unit_t unit) {
    uint16_t value;
    check_esp_err(pcnt_get_filter_value(unit, &value));

    return filter_to_ns(value);
}

STATIC void set_filter_value(pcnt_unit_t unit, int16_t value) {
    /*
    if ((value < 0) || (value > FILTER_MAX)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("correct filter value is 0..%d ns"), filter_to_ns(FILTER_MAX));
    }
    */
    if (value < 0) {
        value = 0;
    } else if (value > FILTER_MAX) {
        value = FILTER_MAX;
    }

    check_esp_err(pcnt_set_filter_value(unit, value));
    if (value) {
        check_esp_err(pcnt_filter_enable(unit));
    } else {
        check_esp_err(pcnt_filter_disable(unit));
    }
}

STATIC void pcnt_disable_events(mp_pcnt_obj_t *self) {
    if (self->handler_match2 != MP_OBJ_NULL) {
        check_esp_err(pcnt_event_disable(self->unit, PCNT_EVT_THRES_0));
        self->handler_match2 = MP_OBJ_NULL;
    }
    if (self->handler_match1 != MP_OBJ_NULL) {
        check_esp_err(pcnt_event_disable(self->unit, PCNT_EVT_THRES_1));
        self->handler_match1 = MP_OBJ_NULL;
    }
    if (self->handler_zero != MP_OBJ_NULL) {
        check_esp_err(pcnt_event_disable(self->unit, PCNT_EVT_ZERO));
        self->handler_zero = MP_OBJ_NULL;
    }
}

STATIC void pcnt_deinit(mp_pcnt_obj_t *self) {
    check_esp_err(pcnt_counter_pause(self->unit));

