micropython/micropython/ports/esp32/machine_encoder.c
    check_esp_err(pcnt_event_disable(self->unit, PCNT_EVT_L_LIM));
    check_esp_err(pcnt_event_disable(self->unit, PCNT_EVT_H_LIM));
    pcnt_disable_events(self);

    check_esp_err(pcnt_set_pin(self->unit, PCNT_CHANNEL_0, PCNT_PIN_NOT_USED, PCNT_PIN_NOT_USED));
    check_esp_err(pcnt_set_pin(self->unit, PCNT_CHANNEL_1, PCNT_PIN_NOT_USED, PCNT_PIN_NOT_USED));

    pcnts[self->unit] = NULL;

    m_del_obj(mp_pcnt_obj_t, self); // Is it need?
}

// This called from Ctrl-D soft reboot
void machine_encoder_deinit_all(void) {
    for (int id = 0; id < PCNT_UNIT_MAX; ++id) {
        pcnt_deinit(pcnts[id]);
    }
    if (pcnt_isr_handle != NULL) {
        #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 2, 0)
        check_esp_err(pcnt_isr_unregister(pcnt_isr_handle));
        #endif
        pcnt_isr_handle = NULL;
    }
}

// =================================================================
// Common classes methods
STATIC mp_obj_t machine_PCNT_deinit(mp_obj_t self_obj) {
    pcnt_deinit(MP_OBJ_TO_PTR(self_obj));
    return MP_ROM_NONE;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_PCNT_deinit_obj, machine_PCNT_deinit);

// -----------------------------------------------------------------
STATIC mp_obj_t machine_PCNT_filter(size_t n_args, const mp_obj_t *args) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    mp_int_t value = get_filter_value_ns(self->unit);
    if (n_args > 1) {
        set_filter_value(self->unit, ns_to_filter(mp_obj_get_int(args[1])));
    }
    return MP_OBJ_NEW_SMALL_INT(value);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_PCNT_filter_obj, 1, 2, machine_PCNT_filter);

// -----------------------------------------------------------------
STATIC mp_obj_t machine_PCNT_count(size_t n_args, const mp_obj_t *args) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    int16_t count;
    check_esp_err(pcnt_get_counter_value(self->unit, &count));
    int64_t counter = self->counter;

    if (n_args > 1) {
        uint64_t new_counter = GET_INT(args[1]);
        if (new_counter) {
            self->counter = new_counter - count;
        } else {
            self->counter = 0;
        }
    }
    return mp_obj_new_int_from_ll(counter + count);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_PCNT_count_obj, 1, 2, machine_PCNT_count);

// -----------------------------------------------------------------
STATIC mp_obj_t machine_PCNT_get_count(mp_obj_t self_obj) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(self_obj);

    int16_t count;
    pcnt_get_counter_value(self->unit, &count); // no error checking to speed up

    return mp_obj_new_int_from_ll(self->counter + count);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_PCNT_get_count_obj, machine_PCNT_get_count);

// -----------------------------------------------------------------
STATIC mp_obj_t machine_PCNT_scaled(size_t n_args, const mp_obj_t *args) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    int64_t counter = self->counter;
    int16_t count;
    check_esp_err(pcnt_get_counter_value(self->unit, &count));
    if (n_args > 1) {
        int64_t new_counter = mp_obj_get_float_to_f(args[1]) / self->scale;
        self->counter = new_counter - count;
    }
    return mp_obj_new_float_from_f(self->scale * (counter + count));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_PCNT_scaled_obj, 1, 2, machine_PCNT_scaled);

// -----------------------------------------------------------------
STATIC mp_obj_t machine_PCNT_pause(mp_obj_t self_obj) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(self_obj);

    check_esp_err(pcnt_counter_pause(self->unit));

    return MP_ROM_NONE;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_PCNT_pause_obj, machine_PCNT_pause);

// -----------------------------------------------------------------
STATIC mp_obj_t machine_PCNT_resume(mp_obj_t self_obj) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(self_obj);

    check_esp_err(pcnt_counter_resume(self->unit));

    return MP_ROM_NONE;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_PCNT_resume_obj, machine_PCNT_resume);

// -----------------------------------------------------------------
STATIC mp_obj_t machine_PCNT_id(mp_obj_t self_obj) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(self_obj);
    return MP_OBJ_NEW_SMALL_INT(self->unit);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_PCNT_id_obj, machine_PCNT_id);

// -----------------------------------------------------------------
STATIC mp_obj_t machine_PCNT_irq(mp_uint_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_handler, ARG_trigger };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_handler, MP_ARG_OBJ, {.u_obj = mp_const_none} },
        { MP_QSTR_trigger, MP_ARG_INT, {.u_int = PCNT_EVT_THRES_0 | PCNT_EVT_THRES_1 | PCNT_EVT_ZERO} },
    };

    mp_pcnt_obj_t *self = pos_args[0];
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_pos_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    mp_obj_t handler = args[ARG_handler].u_obj;
    mp_uint_t trigger = args[ARG_trigger].u_int;

    if (trigger & ~(PCNT_EVT_THRES_1 | PCNT_EVT_THRES_0 | PCNT_EVT_ZERO)) {
        mp_raise_ValueError(MP_ERROR_TEXT("trigger"));
    }

    if (handler != mp_const_none) {
        if (trigger & PCNT_EVT_THRES_0) {
            self->handler_match2 = handler;
            pcnt_event_enable(self->unit, PCNT_EVT_THRES_0);
        } else {
            pcnt_event_disable(self->unit, PCNT_EVT_THRES_0);
        }
        if (trigger & PCNT_EVT_THRES_1) {
            self->handler_match1 = handler;
            pcnt_event_enable(self->unit, PCNT_EVT_THRES_1);
        } else {
            pcnt_event_disable(self->unit, PCNT_EVT_THRES_1);
        }
        if (trigger & PCNT_EVT_ZERO) {
            self->handler_zero = handler;
            pcnt_event_enable(self->unit, PCNT_EVT_ZERO);
        } else {
            pcnt_event_disable(self->unit, PCNT_EVT_ZERO);
        }
    } else {
        pcnt_disable_events(self);
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_PCNT_irq_obj, 1, machine_PCNT_irq);

// =================================================================
// class Counter(object):
STATIC void attach_Counter(mp_pcnt_obj_t *self) {
    // Prepare configuration for the PCNT unit
    pcnt_config_t r_enc_config;
    r_enc_config.pulse_gpio_num = self->aPinNumber; // Pulses
    r_enc_config.ctrl_gpio_num = self->bPinNumber; // Direction

    r_enc_config.unit = self->unit;
    r_enc_config.channel = PCNT_CHANNEL_0;

    // What to do on the positive / negative edge of pulse input?
    if (self->edge & FALLING) {
        r_enc_config.pos_mode = PCNT_COUNT_INC; // Count up on the positive edge
    } else {
        r_enc_config.pos_mode = PCNT_COUNT_DIS; // Keep the counter value on the positive edge
    }
    if (self->edge & RISING) {
        r_enc_config.neg_mode = PCNT_COUNT_INC; // Count up on the negative edge
    } else {
        r_enc_config.neg_mode = PCNT_COUNT_DIS; // Keep the counter value on the negative edge

