micropython/micropython/ports/esp32/machine_encoder.c
    }
    // What to do when control input is low or high?
    r_enc_config.lctrl_mode = PCNT_MODE_REVERSE; // Reverse counting direction if low
    r_enc_config.hctrl_mode = PCNT_MODE_KEEP; // Keep the primary counter mode if high

    // Set the maximum and minimum limit values to watch
    r_enc_config.counter_h_lim = INT16_ROLL;
    r_enc_config.counter_l_lim = -INT16_ROLL;

    check_esp_err(pcnt_unit_config(&r_enc_config));
    check_esp_err(pcnt_counter_pause(self->unit));

    // Filter out bounces and noise
    set_filter_value(self->unit, self->filter); // Filter Runt Pulses

    // Enable events on maximum and minimum limit values
    check_esp_err(pcnt_event_enable(self->unit, PCNT_EVT_H_LIM));
    check_esp_err(pcnt_event_enable(self->unit, PCNT_EVT_L_LIM));

    check_esp_err(pcnt_counter_clear(self->unit));
    self->counter = 0;

    pcnts[self->unit] = self;

    // Enable interrupts for PCNT unit
    check_esp_err(pcnt_intr_enable(self->unit));
}

STATIC void mp_machine_Counter_init_helper(mp_pcnt_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    check_esp_err(pcnt_counter_pause(self->unit));

    enum { ARG_src, ARG_direction, ARG_edge, ARG_filter, ARG_scale, ARG_match1, ARG_match2 };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_src, MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_direction, MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_edge, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_filter_ns, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_scale, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_match1, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_match2, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    mp_obj_t src = args[ARG_src].u_obj;
    if (src != MP_OBJ_NULL) {
        self->aPinNumber = machine_pin_get_id(src);
    }

    mp_obj_t direction = args[ARG_direction].u_obj;
    if (direction != MP_OBJ_NULL) {
        if (mp_obj_is_type(direction, &mp_type_int)) {
            mp_obj_get_int(direction); // TODO
        } else {
            self->bPinNumber = machine_pin_get_id(direction);
        }
    }
    check_esp_err(pcnt_set_pin(self->unit, PCNT_CHANNEL_0, self->aPinNumber, self->bPinNumber));

    if (args[ARG_edge].u_int != -1) {
        self->edge = args[ARG_edge].u_int;
    }

    if (args[ARG_filter].u_int != -1) {
        self->filter = ns_to_filter(args[ARG_filter].u_int);
        set_filter_value(self->unit, self->filter);
    }

    if (args[ARG_scale].u_obj != MP_OBJ_NULL) {
        if (mp_obj_is_type(args[ARG_scale].u_obj, &mp_type_float)) {
            self->scale = mp_obj_get_float_to_f(args[ARG_scale].u_obj);
        } else if (mp_obj_is_type(args[ARG_scale].u_obj, &mp_type_int)) {
            self->scale = mp_obj_get_int(args[ARG_scale].u_obj);
        } else {
            mp_raise_TypeError(MP_ERROR_TEXT("scale argument muts be a number"));
        }
    }

    if (args[ARG_match1].u_obj != MP_OBJ_NULL) {
        self->match1 = GET_INT(args[ARG_match1].u_obj);
        self->counter_match1 = self->match1 % INT16_ROLL;
        check_esp_err(pcnt_set_event_value(self->unit, PCNT_EVT_THRES_1, (int16_t)self->counter_match1));
        self->counter_match1 = self->match1 - self->counter_match1;
    }
    if (args[ARG_match2].u_obj != MP_OBJ_NULL) {
        self->match2 = GET_INT(args[ARG_match2].u_obj);
        self->counter_match2 = self->match2 % INT16_ROLL;
        check_esp_err(pcnt_set_event_value(self->unit, PCNT_EVT_THRES_0, (int16_t)self->counter_match2));
        self->counter_match2 = self->match2 - self->counter_match2;
    }
    check_esp_err(pcnt_counter_resume(self->unit));
}

STATIC mp_obj_t machine_Counter_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    register_isr_handler();

    mp_arg_check_num(n_args, n_kw, 1, 5, true);

    // create Counter object for the given unit
    mp_pcnt_obj_t *self = m_new_obj(mp_pcnt_obj_t);
    self->base.type = &machine_Counter_type;

    self->unit = mp_obj_get_int(args[0]);
    if ((self->unit < 0) || (self->unit >= PCNT_UNIT_MAX)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("id must be from 0 to %d"), PCNT_UNIT_MAX - 1);
    }
    if (pcnts[self->unit] != NULL) {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("already used"));
    }

    self->aPinNumber = PCNT_PIN_NOT_USED;
    if (n_args >= 2) {
        self->aPinNumber = machine_pin_get_id(args[1]);
    }
    if (self->aPinNumber == PCNT_PIN_NOT_USED) {
        mp_raise_TypeError(MP_ERROR_TEXT("'src' argument required, either pos or kw arg are allowed"));
    }

    self->bPinNumber = PCNT_PIN_NOT_USED;
    if (n_args >= 3) {
        self->bPinNumber = machine_pin_get_id(args[2]);
    }
    self->edge = RISING;
    self->scale = 1.0;
    self->filter = 0;

    self->match1 = 0;
    self->match2 = 0;
    self->counter_match1 = 0;
    self->counter_match2 = 0;

    attach_Counter(self);

    // Process the remaining parameters
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_Counter_init_helper(self, n_args - 1, args + 1, &kw_args);

    return MP_OBJ_FROM_PTR(self);
}

STATIC void common_print_pin(const mp_print_t *print, mp_pcnt_obj_t *self) {
    mp_printf(print, "%u, Pin(%u)", self->unit, self->aPinNumber);
    if (self->bPinNumber != PCNT_PIN_NOT_USED) {
        mp_printf(print, ", Pin(%u)", self->bPinNumber);
    }
}

STATIC void common_print_kw(const mp_print_t *print, mp_pcnt_obj_t *self) {
    mp_printf(print, ", filter_ns=%u", get_filter_value_ns(self->unit));
    mp_printf(print, ", scale=%f", self->scale);
    mp_printf(print, ", match1=%ld", self->match1);
    mp_printf(print, ", match2=%ld", self->match2);
}

STATIC void machine_Counter_print(const mp_print_t *print, mp_obj_t self_obj, mp_print_kind_t kind) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(self_obj);

