micropython/micropython/ports/esp32/machine_encoder.c
    check_esp_err(pcnt_set_pin(self->unit, PCNT_CHANNEL_0, self->aPinNumber, self->bPinNumber));
    check_esp_err(pcnt_set_pin(self->unit, PCNT_CHANNEL_1, self->bPinNumber, self->aPinNumber));

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    if (args[ARG_x124].u_int != -1) {
        if ((args[ARG_x124].u_int == 1) || (args[ARG_x124].u_int == 2) || (args[ARG_x124].u_int == 4)) {
            self->x124 = args[ARG_x124].u_int;
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT(MP_ERROR_TEXT("x124 must be 1, 2, 4")));
        }
    }


    if (args[ARG_filter].u_int != -1) {
        self->filter = ns_to_filter(args[ARG_filter].u_int);
        set_filter_value(self->unit, self->filter);
    }

    if (args[ARG_scale].u_obj != MP_OBJ_NULL) {
        if (mp_obj_is_type(args[ARG_scale].u_obj, &mp_type_float)) {
            self->scale = mp_obj_get_float_to_f(args[ARG_scale].u_obj);
        } else if (mp_obj_is_type(args[ARG_scale].u_obj, &mp_type_float)) {
            self->scale = mp_obj_get_int(args[ARG_scale].u_obj);
        } else {
            mp_raise_TypeError(MP_ERROR_TEXT("scale argument muts be a number"));
        }
    }
}

STATIC mp_obj_t machine_Encoder_make_new(const mp_obj_type_t *t_ype, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    register_isr_handler();

    mp_arg_check_num(n_args, n_kw, 1, 5, true);

    // create Encoder object for the given unit
    mp_pcnt_obj_t *self = m_new_obj(mp_pcnt_obj_t);
    self->base.type = &machine_Encoder_type;

    self->unit = mp_obj_get_int(args[0]);
    if ((self->unit < 0) || (self->unit >= PCNT_UNIT_MAX)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("id must be from 0 to %d"), PCNT_UNIT_MAX - 1);
    }
    if (pcnts[self->unit] != NULL) {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("already used"));
    }

    self->x124 = 4;
    self->scale = 1.0;
    self->filter = 0;

    self->match1 = 0;
    self->match2 = 0;
    self->counter_match1 = 0;
    self->counter_match2 = 0;

    self->aPinNumber = PCNT_PIN_NOT_USED;
    self->bPinNumber = PCNT_PIN_NOT_USED;
    if (n_args >= 2) {
        self->aPinNumber = machine_pin_get_id(args[1]);
    }
    if (n_args >= 3) {
        self->bPinNumber = machine_pin_get_id(args[2]);
    }
    if (self->aPinNumber == PCNT_PIN_NOT_USED) {
        mp_raise_TypeError(MP_ERROR_TEXT("'phase_a' argument required, either pos or kw arg are allowed"));
    }
    if (self->bPinNumber == PCNT_PIN_NOT_USED) {
        mp_raise_TypeError(MP_ERROR_TEXT("'phase_b' argument required, either pos or kw arg are allowed"));
    }

    // Process the remaining parameters
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_Encoder_init_helper(self, n_args - 1, args + 1, &kw_args);

    attach_Encoder(self);

    return MP_OBJ_FROM_PTR(self);
}

STATIC mp_obj_t machine_Encoder_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    mp_machine_Encoder_init_helper(args[0], n_args - 1, args + 1, kw_args);
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_KW(machine_Encoder_init_obj, 1, machine_Encoder_init);

STATIC void machine_Encoder_print(const mp_print_t *print, mp_obj_t self_obj, mp_print_kind_t kind) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(self_obj);

    mp_printf(print, "Encoder(");
    common_print_pin(print, self);
    mp_printf(print, ", x124=%d", self->x124);
    common_print_kw(print, self);
    mp_printf(print, ")");
}

// Register class methods
STATIC const mp_rom_map_elem_t machine_Encoder_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_Encoder_init_obj) },
    COMMON_METHODS,
    COMMON_CONSTANTS
};
STATIC MP_DEFINE_CONST_DICT(machine_Encoder_locals_dict, machine_Encoder_locals_dict_table);

// Create the class-object itself
const mp_obj_type_t machine_Encoder_type = {
    { &mp_type_type },
    .name = MP_QSTR_Encoder,
    .print = machine_Encoder_print,
    .make_new = machine_Encoder_make_new,
    .locals_dict = (mp_obj_dict_t *)&machine_Encoder_locals_dict,
};

#endif // MICROPY_PY_MACHINE_PCNT
